Tekla Open API Reference for Tekla Structures 2025
CannotLoadAttributesException.AttributeFile Field
The name of the attribute file that was being loaded.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public readonly string AttributeFile
Public ReadOnly AttributeFile As String
Field Value
Type: String
See Also
Reference
CannotLoadAttributesException Class
Tekla.Structures.Drawing Namespace